# Data Wrangling: Join, Combine, and Reshape

In [ ]:
import pandas as pd
import numpy as np

# Hierarchical Indexing

In [ ]:
data = pd.Series(np.random.randn(9),
index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
[1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

In [ ]:
data['a']    # IN Pandas only in iloc we work on index and for othe we give name

In [ ]:

data['a'][2]

In [ ]:
data['a'][3]

In [ ]:
data['c'][2]

In [ ]:
# data['a'][4]  Give Error

In [ ]:
data.index

In [ ]:
data.loc[['a','b','c','d']]

In [ ]:
data.loc[:]

In [ ]:
data.loc[:,2]

In [ ]:
data.loc[:,[2,1]]

In [ ]:
data.loc[:,3]

In [ ]:
data.loc[['a','b'],3]

In [ ]:
data.unstack()  #you could rearrange the data into a DataFrame using its unstack method

In [ ]:
#The inverse operation of unstack is stack:
data.unstack().stack()

In [ ]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
columns=[['Ohio', 'Ohio', 'Colorado'],
['Green', 'Red', 'Green']])
frame

In [ ]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
columns=[['Pakistan', 'Pakistan', 'India'],
['Karachi', 'Lahore', 'Banglore']])
frame

In [ ]:
frame['Pakistan'].loc['b',2]

In [ ]:
frame['Pakistan'].iloc[3]

In [ ]:
frame.index.names = ['key1', 'key2']
frame

In [ ]:
frame.columns.names = ['Country', 'City']

In [ ]:
frame

# Merging on Index

In [9]:
import pandas as pd
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'key1': ['a', 'm','k','l','m','n'],
    'data1': range(6)})
df1

  key key1  data1
0   b    a      0
1   b    m      1
2   a    k      2
3   c    l      3
4   a    m      4
5   b    n      5

In [10]:
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],'key1': ['a', 'm','j','n','k'],
     'data2': range(5)})
df2

  key key1  data2
0   a    a      0
1   b    m      1
2   a    j      2
3   b    n      3
4   d    k      4

In [11]:
pd.merge(df1, df2)

  key key1  data1  data2
0   b    m      1      1
1   b    n      5      3

# if the column name are not same  then error will come

# To avoid this left_on and right_on

In [12]:
df3 = pd.DataFrame({'key3': ['b', 'b', 'a', 'c', 'a', 'b'],'key4': ['a', 'm','k','l','m','n'],
    'data1': range(6)})
df3

  key3 key4  data1
0    b    a      0
1    b    m      1
2    a    k      2
3    c    l      3
4    a    m      4
5    b    n      5

In [13]:
df4 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],'key1': ['a', 'm','j','n','k'],
     'data2': range(5)})
df4

  key key1  data2
0   a    a      0
1   b    m      1
2   a    j      2
3   b    n      3
4   d    k      4

In [16]:
pd.merge(df3,df4,left_on='key4',right_on='key1',how='inner')

  key3 key4  data1 key key1  data2
0    b    a      0   a    a      0
1    b    m      1   b    m      1
2    a    m      4   b    m      1
3    a    k      2   d    k      4
4    b    n      5   b    n      3

In [17]:
pd.merge(df3,df4,left_on='key4',right_on='key1',how='outer') #Outer will give the NaN whos epair are not make

  key3 key4  data1  key key1  data2
0    b    a    0.0    a    a    0.0
1    b    m    1.0    b    m    1.0
2    a    m    4.0    b    m    1.0
3    a    k    2.0    d    k    4.0
4    c    l    3.0  NaN  NaN    NaN
5    b    n    5.0    b    n    3.0
6  NaN  NaN    NaN    a    j    2.0

In [18]:
pd.merge(df3,df4,left_on='key4',right_on='key1',how='left')

  key3 key4  data1  key key1  data2
0    b    a      0    a    a    0.0
1    b    m      1    b    m    1.0
2    a    k      2    d    k    4.0
3    c    l      3  NaN  NaN    NaN
4    a    m      4    b    m    1.0
5    b    n      5    b    n    3.0

In [19]:
pd.merge(df3,df4,left_on='key4',right_on='key1',how='right')

  key3 key4  data1 key key1  data2
0    b    a    0.0   a    a      0
1    b    m    1.0   b    m      1
2    a    m    4.0   b    m      1
3    a    k    2.0   d    k      4
4    b    n    5.0   b    n      3
5  NaN  NaN    NaN   a    j      2

In [21]:
#JOIN

df3 = pd.DataFrame({'key3': ['b', 'b', 'a', 'c'],'key4': ['a', 'm','k','l'],
    'data1': range(4)})
df3

  key3 key4  data1
0    b    a      0
1    b    m      1
2    a    k      2
3    c    l      3

In [22]:
df4 = pd.DataFrame({'key': ['a', 'b', 'a', 'b'],'key1': ['a', 'm','j','n'],
     'data2': range(4)})
df4

  key key1  data2
0   a    a      0
1   b    m      1
2   a    j      2
3   b    n      3

In [24]:
df3.join(df4)

  key3 key4  data1 key key1  data2
0    b    a      0   a    a      0
1    b    m      1   b    m      1
2    a    k      2   a    j      2
3    c    l      3   b    n      3

In [25]:
df3.join(df4,how='outer') #By dafault how me Inner hota hai

  key3 key4  data1 key key1  data2
0    b    a      0   a    a      0
1    b    m      1   b    m      1
2    a    k      2   a    j      2
3    c    l      3   b    n      3

#Merge by dafualt column ki base pr merge krta hai aur join index ki base pr merge krta hai

# Concatenating Along an Axis

In [27]:
import numpy as np
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
     columns=['one', 'two'])
df1

   one  two
a    0    1
b    2    3
c    4    5

In [31]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],
     columns=['one', 'two'])
df2

   one  two
a    5    6
c    7    8

In [32]:
pd.concat([df1,df2])

   one  two
a    0    1
b    2    3
c    4    5
a    5    6
c    7    8